Здравствуйте {$name}!<br/>

Благодарим, Вы отправили заявку «Помощь и участие в торгах» на сайте Банкротный шпион: <a href="http://bankrot-spy.ru">http://bankrot-spy.ru</a><br/>
Номер вашей заявки: {$id}<br/>
В ближайшее время наши специалисты свяжутся с вами.<br/><br/>

Для получения доступа ко всем информационным материалам сайта, в том числе учебнику и аналитическим показателям, помогающим выбрать более доходные и качественные лоты, пожалуйста, пройдите регистрацию на сайте: <a href="http://bankrot-spy.ru/user/register">http://bankrot-spy.ru/user/register</a><br/><br/>

С уважением<br/>
команда Банкротный шпион: <a href="http://bankrot-spy.ru">http://bankrot-spy.ru</a>